## staging: ses_to_sqs_email_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger`  |
| delete | `aws_lambda_permission.allow_sns_ses_callbacks`                |
|        | `aws_sns_topic_subscription.ses_sns_to_lambda`                 |
| update | `module.ses_to_sqs_email_callbacks.aws_iam_policy.policies[0]` |
|        | `module.ses_to_sqs_email_callbacks.aws_lambda_function.this`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger will be created
  + resource "aws_lambda_event_source_mapping" "sqs_batch_callbacks_trigger" {
      + arn                                = (known after apply)
      + batch_size                         = 10
      + enabled                            = true
      + function_arn                       = (known after apply)
      + function_name                      = "ses_to_sqs_email_callbacks"
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 1
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + tags_all                           = (known after apply)
      + uuid                               = (known after apply)
        # (1 unchanged attribute hidden)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_permission.allow_sns_ses_callbacks will be destroyed
  # (because aws_lambda_permission.allow_sns_ses_callbacks is not in configuration)
  - resource "aws_lambda_permission" "allow_sns_ses_callbacks" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "ses_to_sqs_email_callbacks" -> null
      - id                  = "terraform-20250509164519196700000001" -> null
      - principal           = "sns.amazonaws.com" -> null
      - source_arn          = "arn:aws:sns:ca-central-1:239043911459:ses-callback" -> null
      - statement_id        = "terraform-20250509164519196700000001" -> null
      - statement_id_prefix = "terraform-" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_sns_topic_subscription.ses_sns_to_lambda will be destroyed
  # (because aws_sns_topic_subscription.ses_sns_to_lambda is not in configuration)
  - resource "aws_sns_topic_subscription" "ses_sns_to_lambda" {
      - arn                             = "arn:aws:sns:ca-central-1:239043911459:ses-callback:6e8c825c-a40e-44e4-8cdf-d76de01ee4c4" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:ses_to_sqs_email_callbacks" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:ca-central-1:239043911459:ses-callback:6e8c825c-a40e-44e4-8cdf-d76de01ee4c4" -> null
      - owner_id                        = "239043911459" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:ses-callback" -> null
        # (6 unchanged attributes hidden)
    }

  # module.ses_to_sqs_email_callbacks.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id               = "arn:aws:iam::239043911459:policy/ses_to_sqs_email_callbacks-0"
        name             = "ses_to_sqs_email_callbacks-0"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sqs:SendMessage",
                            "sqs:Get*",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:ca-central-1:239043911459:eks-notification-canada-cadelivery-receipts"
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = ""
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ses_to_sqs_email_callbacks.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      - description                    = "2025-05-20T15:28:50Z" -> null
        id                             = "ses_to_sqs_email_callbacks"
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_to_sqs_email_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_to_sqs_email_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_to_sqs_email_callbacks-500-errors-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
